tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Wrap web apps natively
brew "nativefier"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Search engine for developers
cask "devbook"
# Full-featured desktop app for DevDocs.io
cask "devdocs"
# Finds duplicate files in a computer system
cask "dupeguru"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal built on web technologies
cask "hyper"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
cask "mark-text"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Interactive whiteboard application
cask "openboard"
# IDE for professional Python development
cask "pycharm"
cask "react-studio"
# Mathematics software system
cask "sage"
# Draw, paint, & sketch application
cask "sketchbook"
# PDF reader and note-taking application
cask "skim"
# Video player and streaming platform
cask "soda-player"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Scientific editing platform
cask "texmacs"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# View output from scripts in the menu bar
cask "xbar"
# Video communication and virtual meeting platform
cask "zoom"
